leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.ENET.h
/*
 * S32K1xx.ENET.h
 *
 *  Created on: 2020年1月14日
 *      Author: Master.HE
 */

#ifndef S32K1XX_ENET_H_
#define S32K1XX_ENET_H_

#include "S32K1xx.Type.h"

#if (defined (__Target_S32K148__))

/** ENET - Size of Registers Arrays */
#define ENET_CHANNEL_COUNT                       4u
//-------------------------------------------------------------------------------------------------
//ENET
typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:15;
		__IO uint32_t TS_TIMER				:1;

		__IO uint32_t TS_AVAIL				:1;
		__IO uint32_t WAKEUP				:1;
		__IO uint32_t PLR					:1;
		__IO uint32_t UN					:1;
		__IO uint32_t RL					:1;
		__IO uint32_t LC					:1;
		__IO uint32_t EBERR					:1;
		__IO uint32_t MII					:1;

		__IO uint32_t RXB					:1;
		__IO uint32_t RXF					:1;
		__IO uint32_t TXB					:1;
		__IO uint32_t TXF					:1;
		__IO uint32_t GRA					:1;
		__IO uint32_t BABT					:1;
		__IO uint32_t BABR					:1;
		__IO uint32_t						:1;
	}Bit;
}ENET_EIR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:15;
		__IO uint32_t TS_TIMER				:1;

		__IO uint32_t TS_AVAIL				:1;
		__IO uint32_t WAKEUP				:1;
		__IO uint32_t PLR					:1;
		__IO uint32_t UN					:1;
		__IO uint32_t RL					:1;
		__IO uint32_t LC					:1;
		__IO uint32_t EBERR					:1;
		__IO uint32_t MII					:1;

		__IO uint32_t RXB					:1;
		__IO uint32_t RXF					:1;
		__IO uint32_t TXB					:1;
		__IO uint32_t TXF					:1;
		__IO uint32_t GRA					:1;
		__IO uint32_t BABT					:1;
		__IO uint32_t BABR					:1;
		__IO uint32_t						:1;
	}Bit;
}ENET_EIMR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:24;
		__IO uint32_t RDAR					:1;
		__IO uint32_t						:7;
	}Bit;
}ENET_RDAR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:24;
		__IO uint32_t TDAR					:1;
		__IO uint32_t						:7;
	}Bit;
}ENET_TDAR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t RESET					:1;
		__IO uint32_t ETHEREN				:1;
		__IO uint32_t MAGICEN				:1;
		__IO uint32_t SLEEP					:1;
		__IO uint32_t EN1588				:1;
		__IO uint32_t						:1;
		__IO uint32_t DBGEN					:1;
		__IO uint32_t						:1;

		__IO uint32_t DBSWP					:1;
		__IO uint32_t 						:23;
	}Bit;
}ENET_ECR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DATA					:16;

		__IO uint32_t TA					:2;
		__IO uint32_t RA					:5;
		__IO uint32_t PA					:5;
		__IO uint32_t OP					:2;
		__IO uint32_t ST					:2;
	}Bit;
}ENET_MMFR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:1;
		__IO uint32_t MII_SPEED				:6;
		__IO uint32_t DIS_PRE				:1;

		__IO uint32_t HOLDTIME				:3;
		__IO uint32_t						:21;
	}Bit;
}ENET_MSCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:29;
		__IO uint32_t MIB_CLEAR				:1;
		__IO uint32_t MIB_IDLE				:1;
		__IO uint32_t MIB_DIS				:1;
	}Bit;
}ENET_MIBC_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t LOOP					:1;
		__IO uint32_t DRT					:1;
		__IO uint32_t MII_MODE				:1;
		__IO uint32_t PROM					:1;
		__IO uint32_t BC_REJ				:1;
		__IO uint32_t FCE					:1;
		__IO uint32_t						:2;

		__IO uint32_t RMII_MODE				:1;
		__IO uint32_t RMII_10T				:1;
		__IO uint32_t						:2;
		__IO uint32_t PADEN					:1;
		__IO uint32_t PAUFWD				:1;
		__IO uint32_t CRCFWD				:1;
		__IO uint32_t CFEN					:1;

		__IO uint32_t MAX_FL				:14;
		__IO uint32_t NLC					:1;
		__IO uint32_t GRS					:1;
	}Bit;
}ENET_RCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t GTS					:1;
		__IO uint32_t						:1;
		__IO uint32_t FDEN					:1;
		__IO uint32_t TFC_PAUSE				:1;
		__IO uint32_t RFC_PAUSE				:1;
		__IO uint32_t ADDSEL				:3;

		__IO uint32_t ADDINS				:1;
		__IO uint32_t CRCFWD				:1;
		__IO uint32_t						:22;
	}Bit;
}ENET_TCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t PADDR3				:8;
		__IO uint32_t PADDR2				:8;
		__IO uint32_t PADDR1				:8;
		__IO uint32_t PADDR0				:8;
	}Bit;
}ENET_PALR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:16;
		__IO uint32_t PADDR5				:8;
		__IO uint32_t PADDR6				:8;
	}Bit;
}ENET_PAUR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t PAUSE_DUR				:16;
		__IO uint32_t OPCODE				:16;
	}Bit;
}ENET_OPD_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t IADDR1;
	}Bit;
}ENET_IAUR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t IADDR2;
	}Bit;
}ENET_IALR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t GADDR1;
	}Bit;
}ENET_GAUR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t GADDR2;
	}Bit;
}ENET_GALR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TFWR					:6;
		__IO uint32_t						:2;

		__IO uint32_t STRFWD				:1;
		__IO uint32_t						:23;
	}Bit;
}ENET_TFWR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:3;
		__IO uint32_t R_DES_START			:29;
	}Bit;
}ENET_RDSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:3;
		__IO uint32_t X_DES_START			:29;
	}Bit;
}ENET_TDSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t						:4;
		__IO uint32_t R_BUF_SIZE			:10;
		__IO uint32_t						:18;
	}Bit;
}ENET_MRBR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t RX_SECTION_FULL		:8;
		__IO uint32_t						:24;
	}Bit;
}ENET_RSFL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t RX_SECTION_EMPTY		:8;
		__IO uint32_t						:8;
		__IO uint32_t STAT_SECTION_EMPTY	:5;
		__IO uint32_t						:11;
	}Bit;
}ENET_RSEM_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t RX_ALMOST_EMPTY		:8;
		__IO uint32_t						:24;
	}Bit;
}ENET_RAEM_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t RX_ALMOST_FULL		:8;
		__IO uint32_t						:24;
	}Bit;
}ENET_RAFL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TX_SECTION_EMPTY		:8;
		__IO uint32_t						:24;
	}Bit;
}ENET_TSEM_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TX_ALMOST_EMPTY		:8;
		__IO uint32_t						:24;
	}Bit;
}ENET_TAEM_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TX_ALMOST_FULL		:8;
		__IO uint32_t						:24;
	}Bit;
}ENET_TAFL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t IPG					:5;
		__IO uint32_t						:27;
	}Bit;
}ENET_TIPG_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TRUNC_FL				:14;
		__IO uint32_t						:18;
	}Bit;
}ENET_FTRL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t SHIFT16				:1;
		__IO uint32_t						:2;
		__IO uint32_t IPCHK					:1;
		__IO uint32_t PROCHK				:1;
		__IO uint32_t						:27;
	}Bit;
}ENET_TACC_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t PADREM				:1;
		__IO uint32_t IPDIS					:1;
		__IO uint32_t PRODIS				:1;
		__IO uint32_t						:3;
		__IO uint32_t LINEDIS				:1;
		__IO uint32_t SHIFT16				:1;

