leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.ENET.h
		__IO uint32_t						:24;
	}Bit;
}ENET_RACC_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t TXPKTS				:16;
		__I  uint32_t						:16;
	}Bit;
}ENET_RMON_T_PACKETS_Type;

//.....


typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t EN					:1;
		__IO uint32_t						:1;
		__IO uint32_t OFFEN					:1;
		__IO uint32_t OFFRST				:1;
		__IO uint32_t PEREN					:1;
		__IO uint32_t						:2;
		__IO uint32_t PINPER				:1;

		__IO uint32_t						:1;
		__IO uint32_t RESTART				:1;
		__IO uint32_t						:1;
		__IO uint32_t CAPTURE				:1;
		__IO uint32_t						:1;
		__IO uint32_t SLAVE					:1;
		__IO uint32_t						:18;
	}Bit;
}ENET_ATCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t ATIME;
	}Bit;
}ENET_ATVR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t OFFSET;
	}Bit;
}ENET_ATOFF_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t PERIOD;
	}Bit;
}ENET_ATPER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t COR					:31;
		__IO uint32_t						:1;
	}Bit;
}ENET_ATCOR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t INC					:7;
		__IO uint32_t						:1;

		__IO uint32_t INC_CORR				:7;
		__IO uint32_t						:17;
	}Bit;
}ENET_ATINC_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t TIMESTAMP;
	}Bit;
}ENET_ATSTMP_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TF0					:1;
		__IO uint32_t TF1					:1;
		__IO uint32_t TF2					:1;
		__IO uint32_t TF3					:1;
		__IO uint32_t						:28;
	}Bit;
}ENET_TGSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDRE					:1;
		__IO uint32_t						:1;
		__IO uint32_t TMODE					:4;
		__IO uint32_t TIE					:1;
		__IO uint32_t TF					:1;
		__IO uint32_t						:24;
	}Bit;
}ENET_TCSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TCC;
	}Bit;
}ENET_TCCR_Type;
//-------------------------------------------------------------------------------------------------
typedef struct
{
	__I  uint8_t RESERVED_0[4];
	ENET_EIR_Type EIR;                               /**< Interrupt Event Register, offset: 0x4 */
	ENET_EIMR_Type EIMR;                              /**< Interrupt Mask Register, offset: 0x8 */
	__I  uint8_t RESERVED_1[4];
	ENET_RDAR_Type RDAR;                              /**< Receive Descriptor Active Register, offset: 0x10 */
	ENET_TDAR_Type TDAR;                              /**< Transmit Descriptor Active Register, offset: 0x14 */
	__I  uint8_t RESERVED_2[12];
	ENET_ECR_Type ECR;                               /**< Ethernet Control Register, offset: 0x24 */
	__I  uint8_t RESERVED_3[24];
	ENET_MMFR_Type MMFR;                              /**< MII Management Frame Register, offset: 0x40 */
	ENET_MSCR_Type MSCR;                              /**< MII Speed Control Register, offset: 0x44 */
	__I  uint8_t RESERVED_4[28];
	ENET_MIBC_Type MIBC;                              /**< MIB Control Register, offset: 0x64 */
	__I  uint8_t RESERVED_5[28];
	ENET_RCR_Type RCR;                               /**< Receive Control Register, offset: 0x84 */
	__I  uint8_t RESERVED_6[60];
	ENET_TCR_Type TCR;                               /**< Transmit Control Register, offset: 0xC4 */
	__I  uint8_t RESERVED_7[28];
	ENET_PALR_Type PALR;                              /**< Physical Address Lower Register, offset: 0xE4 */
	ENET_PAUR_Type PAUR;                              /**< Physical Address Upper Register, offset: 0xE8 */
	ENET_OPD_Type OPD;                               /**< Opcode/Pause Duration Register, offset: 0xEC */
	__I  uint8_t RESERVED_8[40];
	ENET_IAUR_Type IAUR;                              /**< Descriptor Individual Upper Address Register, offset: 0x118 */
	ENET_IALR_Type IALR;                              /**< Descriptor Individual Lower Address Register, offset: 0x11C */
	ENET_GAUR_Type GAUR;                              /**< Descriptor Group Upper Address Register, offset: 0x120 */
	ENET_GALR_Type GALR;                              /**< Descriptor Group Lower Address Register, offset: 0x124 */
	__I  uint8_t RESERVED_9[28];
	ENET_TFWR_Type TFWR;                              /**< Transmit FIFO Watermark Register, offset: 0x144 */
	__I  uint8_t RESERVED_10[56];
	ENET_RDSR_Type RDSR;                              /**< Receive Descriptor Ring Start Register, offset: 0x180 */
	ENET_TDSR_Type TDSR;                              /**< Transmit Buffer Descriptor Ring Start Register, offset: 0x184 */
	ENET_MRBR_Type MRBR;                              /**< Maximum Receive Buffer Size Register, offset: 0x188 */
	__I  uint8_t RESERVED_11[4];
	ENET_RSFL_Type RSFL;                              /**< Receive FIFO Section Full Threshold, offset: 0x190 */
	ENET_RSEM_Type RSEM;                              /**< Receive FIFO Section Empty Threshold, offset: 0x194 */
	ENET_RAEM_Type RAEM;                              /**< Receive FIFO Almost Empty Threshold, offset: 0x198 */
	ENET_RAFL_Type RAFL;                              /**< Receive FIFO Almost Full Threshold, offset: 0x19C */
	ENET_TSEM_Type TSEM;                              /**< Transmit FIFO Section Empty Threshold, offset: 0x1A0 */
	ENET_TAEM_Type TAEM;                              /**< Transmit FIFO Almost Empty Threshold, offset: 0x1A4 */
	ENET_TAFL_Type TAFL;                              /**< Transmit FIFO Almost Full Threshold, offset: 0x1A8 */
	ENET_TIPG_Type TIPG;                              /**< Transmit Inter-Packet Gap, offset: 0x1AC */
	ENET_FTRL_Type FTRL;                              /**< Frame Truncation Length, offset: 0x1B0 */
	__I  uint8_t RESERVED_12[12];
	ENET_TACC_Type TACC;                              /**< Transmit Accelerator Function Configuration, offset: 0x1C0 */
	ENET_RACC_Type RACC;                              /**< Receive Accelerator Function Configuration, offset: 0x1C4 */
	__I  uint8_t RESERVED_13[56];
	__I  uint32_t RMON_T_DROP;                       /**< Reserved Statistic Register, offset: 0x200 */
	ENET_RMON_T_PACKETS_Type RMON_T_PACKETS;                    /**< Tx Packet Count Statistic Register, offset: 0x204 */
	__I  uint32_t RMON_T_BC_PKT;                     /**< Tx Broadcast Packets Statistic Register, offset: 0x208 */
	__I  uint32_t RMON_T_MC_PKT;                     /**< Tx Multicast Packets Statistic Register, offset: 0x20C */
	__I  uint32_t RMON_T_CRC_ALIGN;                  /**< Tx Packets with CRC/Align Error Statistic Register, offset: 0x210 */
	__I  uint32_t RMON_T_UNDERSIZE;                  /**< Tx Packets Less Than Bytes and Good CRC Statistic Register, offset: 0x214 */
	__I  uint32_t RMON_T_OVERSIZE;                   /**< Tx Packets GT MAX_FL bytes and Good CRC Statistic Register, offset: 0x218 */
	__I  uint32_t RMON_T_FRAG;                       /**< Tx Packets Less Than 64 Bytes and Bad CRC Statistic Register, offset: 0x21C */
	__I  uint32_t RMON_T_JAB;                        /**< Tx Packets Greater Than MAX_FL bytes and Bad CRC Statistic Register, offset: 0x220 */
	__I  uint32_t RMON_T_COL;                        /**< Tx Collision Count Statistic Register, offset: 0x224 */
	__I  uint32_t RMON_T_P64;                        /**< Tx 64-Byte Packets Statistic Register, offset: 0x228 */
	__I  uint32_t RMON_T_P65TO127;                   /**< Tx 65- to 127-byte Packets Statistic Register, offset: 0x22C */
	__I  uint32_t RMON_T_P128TO255;                  /**< Tx 128- to 255-byte Packets Statistic Register, offset: 0x230 */
	__I  uint32_t RMON_T_P256TO511;                  /**< Tx 256- to 511-byte Packets Statistic Register, offset: 0x234 */
	__I  uint32_t RMON_T_P512TO1023;                 /**< Tx 512- to 1023-byte Packets Statistic Register, offset: 0x238 */
	__I  uint32_t RMON_T_P1024TO2047;                /**< Tx 1024- to 2047-byte Packets Statistic Register, offset: 0x23C */
	__I  uint32_t RMON_T_P_GTE2048;                  /**< Tx Packets Greater Than 2048 Bytes Statistic Register, offset: 0x240 */
	__I  uint32_t RMON_T_OCTETS;                     /**< Tx Octets Statistic Register, offset: 0x244 */
	__I  uint32_t IEEE_T_DROP;                       /**< Reserved Statistic Register, offset: 0x248 */
	__I  uint32_t IEEE_T_FRAME_OK;                   /**< Frames Transmitted OK Statistic Register, offset: 0x24C */
	__I  uint32_t IEEE_T_1COL;                       /**< Frames Transmitted with Single Collision Statistic Register, offset: 0x250 */
	__I  uint32_t IEEE_T_MCOL;                       /**< Frames Transmitted with Multiple Collisions Statistic Register, offset: 0x254 */
	__I  uint32_t IEEE_T_DEF;                        /**< Frames Transmitted after Deferral Delay Statistic Register, offset: 0x258 */
	__I  uint32_t IEEE_T_LCOL;                       /**< Frames Transmitted with Late Collision Statistic Register, offset: 0x25C */
	__I  uint32_t IEEE_T_EXCOL;                      /**< Frames Transmitted with Excessive Collisions Statistic Register, offset: 0x260 */
	__I  uint32_t IEEE_T_MACERR;                     /**< Frames Transmitted with Tx FIFO Underrun Statistic Register, offset: 0x264 */
	__I  uint32_t IEEE_T_CSERR;                      /**< Frames Transmitted with Carrier Sense Error Statistic Register, offset: 0x268 */
	__I  uint32_t IEEE_T_SQE;                        /**< Reserved Statistic Register, offset: 0x26C */
	__I  uint32_t IEEE_T_FDXFC;                      /**< Flow Control Pause Frames Transmitted Statistic Register, offset: 0x270 */
	__I  uint32_t IEEE_T_OCTETS_OK;                  /**< Octet Count for Frames Transmitted w/o Error Statistic Register, offset: 0x274 */
	__I  uint8_t RESERVED_14[12];
	__I  uint32_t RMON_R_PACKETS;                    /**< Rx Packet Count Statistic Register, offset: 0x284 */
	__I  uint32_t RMON_R_BC_PKT;                     /**< Rx Broadcast Packets Statistic Register, offset: 0x288 */
	__I  uint32_t RMON_R_MC_PKT;                     /**< Rx Multicast Packets Statistic Register, offset: 0x28C */
	__I  uint32_t RMON_R_CRC_ALIGN;                  /**< Rx Packets with CRC/Align Error Statistic Register, offset: 0x290 */
	__I  uint32_t RMON_R_UNDERSIZE;                  /**< Rx Packets with Less Than 64 Bytes and Good CRC Statistic Register, offset: 0x294 */
	__I  uint32_t RMON_R_OVERSIZE;                   /**< Rx Packets Greater Than MAX_FL and Good CRC Statistic Register, offset: 0x298 */
	__I  uint32_t RMON_R_FRAG;                       /**< Rx Packets Less Than 64 Bytes and Bad CRC Statistic Register, offset: 0x29C */
	__I  uint32_t RMON_R_JAB;                        /**< Rx Packets Greater Than MAX_FL Bytes and Bad CRC Statistic Register, offset: 0x2A0 */
	__I  uint32_t RMON_R_RESVD_0;                    /**< Reserved Statistic Register, offset: 0x2A4 */
	__I  uint32_t RMON_R_P64;                        /**< Rx 64-Byte Packets Statistic Register, offset: 0x2A8 */
	__I  uint32_t RMON_R_P65TO127;                   /**< Rx 65- to 127-Byte Packets Statistic Register, offset: 0x2AC */
	__I  uint32_t RMON_R_P128TO255;                  /**< Rx 128- to 255-Byte Packets Statistic Register, offset: 0x2B0 */
	__I  uint32_t RMON_R_P256TO511;                  /**< Rx 256- to 511-Byte Packets Statistic Register, offset: 0x2B4 */
	__I  uint32_t RMON_R_P512TO1023;                 /**< Rx 512- to 1023-Byte Packets Statistic Register, offset: 0x2B8 */
	__I  uint32_t RMON_R_P1024TO2047;                /**< Rx 1024- to 2047-Byte Packets Statistic Register, offset: 0x2BC */
	__I  uint32_t RMON_R_P_GTE2048;                  /**< Rx Packets Greater than 2048 Bytes Statistic Register, offset: 0x2C0 */
	__I  uint32_t RMON_R_OCTETS;                     /**< Rx Octets Statistic Register, offset: 0x2C4 */
	__I  uint32_t IEEE_R_DROP;                       /**< Frames not Counted Correctly Statistic Register, offset: 0x2C8 */
	__I  uint32_t IEEE_R_FRAME_OK;                   /**< Frames Received OK Statistic Register, offset: 0x2CC */
	__I  uint32_t IEEE_R_CRC;                        /**< Frames Received with CRC Error Statistic Register, offset: 0x2D0 */
	__I  uint32_t IEEE_R_ALIGN;                      /**< Frames Received with Alignment Error Statistic Register, offset: 0x2D4 */
	__I  uint32_t IEEE_R_MACERR;                     /**< Receive FIFO Overflow Count Statistic Register, offset: 0x2D8 */
	__I  uint32_t IEEE_R_FDXFC;                      /**< Flow Control Pause Frames Received Statistic Register, offset: 0x2DC */
	__I  uint32_t IEEE_R_OCTETS_OK;                  /**< Octet Count for Frames Received without Error Statistic Register, offset: 0x2E0 */
	__I  uint8_t RESERVED_15[284];
	ENET_ATCR_Type ATCR;                              /**< Adjustable Timer Control Register, offset: 0x400 */
	ENET_ATVR_Type ATVR;                              /**< Timer Value Register, offset: 0x404 */
	ENET_ATOFF_Type ATOFF;                             /**< Timer Offset Register, offset: 0x408 */
	ENET_ATPER_Type ATPER;                             /**< Timer Period Register, offset: 0x40C */
	ENET_ATCOR_Type ATCOR;                             /**< Timer Correction Register, offset: 0x410 */
	ENET_ATINC_Type ATINC;                             /**< Time-Stamping Clock Period Register, offset: 0x414 */
	ENET_ATSTMP_Type ATSTMP;                            /**< Timestamp of Last Transmitted Frame, offset: 0x418 */
	__I  uint8_t RESERVED_16[488];
	ENET_TGSR_Type TGSR;                              /**< Timer Global Status Register, offset: 0x604 */
	struct                                          /* offset: 0x608, array step: 0x8 */
	{
		ENET_TCSR_Type TCSR;                          /**< Timer Control Status Register, array offset: 0x608, array step: 0x8 */
		ENET_TCCR_Type TCCR;                          /**< Timer Compare Capture Register, array offset: 0x60C, array step: 0x8 */
	} CHANNEL[ENET_CHANNEL_COUNT];
}ENET_Type;
//-------------------------------------------------------------------------------------------------






/* ----------------------------------------------------------------------------
   -- ENET Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENET_Peripheral_Access_Layer ENET Peripheral Access Layer
 * @{
 */




